app/controllers/categories_controller.rb

SELECT * FROM "articles" WHERE (category_id != 1) ORDER BY created_at DESC
---
  def index
    if session[:logged]
      @articles = Article.find :all , :order => "created_at DESC"